<a href="https://colab.research.google.com/github/lismarcarolinacamacho/R-Y-SQL/blob/main/pruebas_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# CREATING THE TABLE
import sqlite3


conn = sqlite3.connect('test.db')

conn.execute('''
CREATE TABLE team_data(team text, 
                      country text, 
                      season integer, 
                      total_goals integer);''')
conn.commit()

conn.close()

print("Opened database successfully");
print("Table created successfully");

Opened database successfully
Table created successfully

In [ ]:
# INSERTING VALUES
conn = sqlite3.connect('test.db')

conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2019, 47);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2019, 52);")
conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2018, 49);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2018, 45);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2018, 50 );")

conn.commit()

In [ ]:
# Average goal by team

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team,
                            AVG(total_goals) AS avg_goals
                          FROM team_data
                          GROUP BY team;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Barcelona', 46.0)
('Real Madrid', 49.0)

In [ ]:
# Now, the correct query, using the appropriate sub-query

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team_name, avg_goals
                          FROM (

                          -- Here we make our sub-query:
                            SELECT team AS team_name,
                            AVG(total_goals) AS avg_goals
                            FROM team_data
                            GROUP BY team) tp
                          -- End of the sub-query
                          
                          WHERE avg_goals > 50;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)

In [1]:
import sqlite3
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute(

'''
DROP TABLE IF EXISTS departments'''
)


conn.commit()

print("Table eliminated successfully");

conn.close()

Opened database successfully
Table eliminated successfully

In [3]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute(

'''
CREATE TABLE departments (
  dept_no char(4) PRIMARY KEY NOT NULL,
  dept_name varchar(40) NOT NULL)'''
)


conn.commit()

print("Table created successfully");

conn.close()

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 33))

Opened database successfully

OperationalError: ignored

In [4]:



conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute(

'''
INSERT INTO departments VALUES ('d009','Customer Service')
'''
)

conn.execute("INSERT INTO departments VALUES('d005','Development');")
conn.execute("INSERT INTO departments VALUES('d002','Finance');")
conn.execute("INSERT INTO departments VALUES('d004','Production');")
conn.execute("INSERT INTO departments VALUES('d006','Quality Management');")
conn.execute("INSERT INTO departments VALUES('d008','Research');")
conn.execute("INSERT INTO departments VALUES('d007','Sales');")
conn.commit()
print("Table created successfully");

conn.close()

Opened database successfully
Table created successfully

In [5]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute(

'''
DROP TABLE IF EXISTS dept_emp'''
)


conn.commit()

print("Table eliminated successfully");

conn.close()

Opened database successfully
Table eliminated successfully

In [6]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");
conn.execute(
''' DROP TABLE IF EXISTS employees''')

conn.commit()

print("Table eliminated successfully");

conn.close()

Opened database successfully
Table eliminated successfully

In [7]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");
conn.execute(
''' DROP TABLE IF EXISTS Gender''')

conn.commit()

print("Table eliminated successfully");

conn.close()

Opened database successfully
Table eliminated successfully

In [8]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute(

'''CREATE TABLE Gender (

  gendert CHAR(1) PRIMARY KEY NOT NULL,
  Seq INTEGER
  
  )'''
  
)


conn.commit()

print("Table created successfully");

conn.close()

Opened database successfully
Table created successfully

In [9]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute("INSERT INTO Gender(gendert, Seq) VALUES ('M',1);")

conn.execute("INSERT INTO Gender(gendert, Seq) VALUES ('F',2);")
conn.commit()

print("data inserted successfully");

conn.close()

Opened database successfully
data inserted successfully

In [10]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute(

'''CREATE TABLE employees (
  emp_no int(11) PRIMARY KEY NOT NULL,
  birth_date date NOT NULL,
  first_name varchar(14) NOT NULL,
  last_name varchar(16) NOT NULL,
  gendert CHAR(1) NOT NULL DEFAULT ('M') REFERENCES gender(gendert),
  hire_date date NOT NULL)'''
)


conn.commit()

print("Table created successfully");

conn.close()

Opened database successfully
Table created successfully

In [11]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");
conn.execute(
''' DROP TABLE IF EXISTS dept_emp''')

conn.commit()

print("Table eliminated successfully");

conn.close()

Opened database successfully
Table eliminated successfully

In [12]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute(

'''
CREATE TABLE dept_emp (
  emp_no int(11) NOT NULL,
  dept_no char(4) NOT NULL,
  from_date date NOT NULL,
  to_date date NOT NULL,
  PRIMARY KEY (emp_no,dept_no),
  FOREIGN KEY (emp_no) REFERENCES employees (emp_no),
  FOREIGN KEY (dept_no) REFERENCES departments (dept_no))'''
)


conn.commit()

print("Table created successfully");

conn.close()

Opened database successfully
Table created successfully

In [13]:
# REVISAR POR QUE NO ME DEJA CREAR CONSTRAINT 

#  CONSTRAINT `dept_emp_ibfk_1` FOREIGN KEY (`emp_no`) REFERENCES `employees` (`emp_no`) ON DELETE CASCADE,

In [14]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute("INSERT INTO employees VALUES (10001,'1953-09-02','Georgi','Facello','M','1986-06-26');")

conn.execute("INSERT INTO employees VALUES (10002,'1964-06-02','Bezalel','Simmel','F','1985-11-21');")
conn.execute("INSERT INTO employees VALUES (10004,'1954-05-01','Chirstian','Koblick','M','1986-12-01');")
conn.execute("INSERT INTO employees VALUES (10005,'1955-01-21','Kyoichi','Maliniak','M','1989-09-12');")
conn.execute("INSERT INTO employees VALUES (10006,'1953-04-20','Anneke','Preusig','F','1989-06-02');")
conn.execute("INSERT INTO employees VALUES (10007,'1957-05-23','Tzvetan','Zielinski','F','1989-02-10');")
conn.execute("INSERT INTO employees VALUES (10008,'1958-02-19','Saniya','Kalloufi','M','1994-09-15');")

conn.commit()

print("Data Inserted successfully");

conn.close()

Opened database successfully
Data Inserted successfully

In [15]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute("DROP TABLE IF EXISTS salaries")

conn.commit()

print("Table eliminated successfully");

conn.close()

Opened database successfully
Table eliminated successfully

In [16]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute(
''' CREATE TABLE salaries (
  emp_no int(11) NOT NULL,
  salary int(11) NOT NULL,
  from_date date NOT NULL,
  to_date date NOT NULL,
  PRIMARY KEY (emp_no,from_date),
  
 FOREIGN KEY (emp_no) REFERENCES employees (emp_no)
);''')

conn.commit()

print("Table created successfully");

conn.close()

Opened database successfully
Table created successfully

In [17]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute("INSERT INTO salaries VALUES (10001,60117,'1986-06-26','1987-06-26');")
conn.execute("INSERT INTO salaries VALUES (10001,62102,'1987-06-26','1988-06-25');")
conn.execute("INSERT INTO salaries VALUES (10001,66074,'1988-06-25','1989-06-25');")
conn.execute("INSERT INTO salaries VALUES (10001,66596,'1989-06-25','1990-06-25');")
conn.execute("INSERT INTO salaries VALUES (10001,66961,'1990-06-25','1991-06-25');")
conn.execute("INSERT INTO salaries VALUES (10001,71046,'1991-06-25','1992-06-24');")
conn.execute("INSERT INTO salaries VALUES (10001,74333,'1992-06-24','1993-06-24');")
conn.execute("INSERT INTO salaries VALUES (10001,75286,'1993-06-24','1994-06-24');")
conn.execute("INSERT INTO salaries VALUES (10001,75994,'1994-06-24','1995-06-24');")
conn.execute("INSERT INTO salaries VALUES (10001,76884,'1995-06-24','1996-06-23');")
conn.execute("INSERT INTO salaries VALUES (10001,80013,'1996-06-23','1997-06-23');")
conn.execute("INSERT INTO salaries VALUES (10001,81025,'1997-06-23','1998-06-23');")
conn.execute("INSERT INTO salaries VALUES (10001,81097,'1998-06-23','1999-06-23');")
conn.execute("INSERT INTO salaries VALUES (10001,84917,'1999-06-23','2000-06-22');")
conn.execute("INSERT INTO salaries VALUES (10001,85112,'2000-06-22','2001-06-22');")
conn.execute("INSERT INTO salaries VALUES (10001,85097,'2001-06-22','2002-06-22');")
conn.execute("INSERT INTO salaries VALUES (10001,88958,'2002-06-22','9999-01-01');")
conn.execute("INSERT INTO salaries VALUES (10002,65828,'1996-08-03','1997-08-03');")
conn.execute("INSERT INTO salaries VALUES (10002,65909,'1997-08-03','1998-08-03');")
conn.execute("INSERT INTO salaries VALUES (10002,67534,'1998-08-03','1999-08-03');")

conn.commit()

print("Data inserted successfully");

conn.close()

Opened database successfully
Data inserted successfully

In [19]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute("DROP TABLE IF EXISTS titles;")
conn.commit()

print("Table eliminated successfully");

conn.close()

Opened database successfully
Table eliminated successfully

In [20]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute('''CREATE TABLE titles (
  emp_no int(11) NOT NULL,
  title varchar(50) NOT NULL,
  from_date date NOT NULL,
  to_date date DEFAULT NULL,
  PRIMARY KEY (emp_no,title,from_date),
  FOREIGN KEY (emp_no) REFERENCES employees (emp_no)
)''')

conn.commit()

print("Table created successfully");

conn.close()

Opened database successfully
Table created successfully

In [21]:
conn = sqlite3.connect('employees.db')
print("Opened database successfully");

conn.execute("INSERT INTO titles VALUES (10001,'Senior Engineer','1986-06-26','9999-01-01');")
conn.execute("INSERT INTO titles VALUES (10002,'Staff','1996-08-03','9999-01-01');")
conn.execute("INSERT INTO titles VALUES (10003,'Senior Engineer','1995-12-03','9999-01-01');")

conn.commit()

print("Data inserted successfully");

conn.close()

Opened database successfully
Data inserted successfully